//Задача 15: Напишите программу, которая принимает на вход цифру, 
//обозначающую день недели, и проверяет, является ли этот день выходным.

//получает число с консоли. "Защита от дурака"
int GetNumberFromConsole(string message)
{
    int result = 0;

    while(true)
    {
        Console.Write(message);

        if(int.TryParse(Console.ReadLine(), out result))
        {
            break;
        }
        else
        {
            Console.WriteLine("Ввели не число.");
        }
    }

    return result;
}

int number = GetNumberFromConsole("Enter the day of week (number): ");
if ((number == 6) || (number == 7))
    {
        Console.WriteLine("The day is weekend");
    }
    else
    {
        Console.WriteLine("The day is weekday");
    }
