/*
Задача 60. ...Сформируйте трёхмерный массив из неповторяющихся двузначных чисел. Напишите программу, которая будет построчно выводить массив, добавляя индексы каждого элемента.
Массив размером 2 x 2 x 2
66(0,0,0) 25(0,1,0)
34(1,0,0) 41(1,1,0)
27(0,0,1) 90(0,1,1)
26(1,0,1) 55(1,1,1)
*/

int[,,] table = new int [2, 2, 2];
table[0,0,0] = 66;
table[0,1,0] = 25;
table[1,0,0] = 34;
table[1,1,0] = 41;
table[0,0,1] = 27;
table[0,1,1] = 90;
table[1,0,1] = 26;
table[1,1,1] = 55;

for (int i = 0; i < table.GetLength(0); i++)
{
    for (int j = 0; j < table.GetLength(1); j++)
    {
        for (int q = 0; q < table.GetLength(2); q++)
        {
            Console.WriteLine($"{table[i, j, q]} ({i}, {j}, {q})");
        }
    }
}








